app/Controllers/Admin.php

SELECT *
FROM `tb_users`
---
    public function user()
    {
        $data_user = $this->user->findAll();

SELECT *
FROM `tb_stasiun`
---
    public function stasiun()
    {
        $data_stasiun = $this->stasiun->findAll();

INSERT INTO `tb_stasiun` (`n_stasiun`) VALUES ('Manggarai')
---
    public function save_stasiun()
    {
        $getStasiun = $this->request->getPost();
        $this->stasiun->save([
            'n_stasiun' => $getStasiun['n_stasiun'],
        ]);

SELECT *
FROM `tb_rute`
---
    public function rute()
    {
        $data_rute = $this->rute->findAll();

SELECT `tb_urutan`.`id` as `id`, `n_stasiun`, `n_rute`, `urutan`
FROM `tb_urutan`
JOIN `tb_stasiun` ON `tb_stasiun`.`id` = `tb_urutan`.`id_stasiun`
JOIN `tb_rute` ON `tb_rute`.`id` = `tb_urutan`.`id_rute`
SELECT *
FROM `tb_stasiun`
SELECT *
FROM `tb_rute`
---
    public function urutan()
    {
        $builder = $this->db->table('tb_urutan');
        $builder->select('tb_urutan.id as id , n_stasiun, n_rute, urutan');
        $builder->join('tb_stasiun', 'tb_stasiun.id = tb_urutan.id_stasiun');
        $builder->join('tb_rute', 'tb_rute.id = tb_urutan.id_rute');
        $query = $builder->get()->getResultArray();
        // var_dump($query);
        //Mengambil data stasiun dan rute dari tb stasiun dan tb rute
        $data_stasiun = $this->stasiun->findAll();
        $data_rute = $this->rute->findAll();

UPDATE `tb_urutan` SET `urutan` = '20'
WHERE `tb_urutan`.`id` IN ('18')
---
    public function edit_urutan($id)
    {
        $getUrutan = $this->request->getPost();
        //echo "ini data id: " . $id;
        $this->urutan->save([
            'id' => $id,
            'urutan' => $getUrutan['urutan'],
        ]);

DELETE FROM `tb_urutan`
WHERE `id` IN ('19')
---
    public function delete_urutan($id)
    {
        $this->urutan->delete($id);