app/Controllers/Admin.php

SELECT *
FROM `tb_rute`
---
    public function rute()
    {
        $data_rute = $this->rute->findAll();

DELETE FROM `tb_rute`
WHERE `id` IN ('22')
---
    public function delete_rute($id)
    {
        $this->rute->delete($id);