app/Controllers/Main.php

SELECT `id`, `n_stasiun`
FROM `tb_stasiun`
ORDER BY `n_stasiun` ASC
---
    public function index()
    {
        $data_stasiun = $this->stasiun->orderBy('n_stasiun', 'ASC')->findAll();