app/Models/Urutan.php

SELECT *
FROM `tb_urutan`
WHERE `id_stasiun` = '93'
OR `id_stasiun` = '4'
ORDER BY `id_rute` ASC, `urutan` ASC
---
    public function getRouteAndOrder($startStation, $endStation)
    {
        $routesModel = new \App\Models\Urutan();
        $rute = $routesModel->where('id_stasiun', $startStation)
                             ->orWhere('id_stasiun', $endStation)
                             ->orderBy('id_rute, urutan', 'ASC')
                             ->findAll();